akamud.vscode-caniuse
attilabuti.vscode-mjml
bajdzis.vscode-database
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
flowtype.flow-for-vscode
GitHub.vscode-pull-request-github
jpoissonnier.vscode-styled-components
mauve.terraform
ms-vscode.Go
naumovs.color-highlight
Orta.vscode-jest
PeterJausovec.vscode-docker
ricard.postcss
robertohuertasm.vscode-icons
VisualStudioExptTeam.vscodeintellicode
WallabyJs.quokka-vscode
wayou.vscode-todo-highlight
wix.vscode-import-cost
