IBM.output-colorizer
RobinMalfait.prettier-eslint-vscode
abusaidm.html-snippets
alefragnani.Bookmarks
alefragnani.project-manager
bajdzis.vscode-database
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-dash
eamodio.gitlens
EditorConfig.EditorConfig
eg2.vscode-npm-script
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
formulahendry.auto-rename-tag
formulahendry.code-runner
gerane.Theme-Monokai-Cobalt
hangxingliu.vscode-nginx-conf-hint
mauve.terraform
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.Go
msjsdiag.debugger-for-chrome
naumovs.color-highlight
rebornix.ruby
redhat.vscode-yaml
robinbentley.sass-indented
shardulm94.trailing-spaces
shinnn.stylelint
spywhere.guides
streetsidesoftware.code-spell-checker
TabNine.tabnine-vscode
vscode-icons-team.vscode-icons
wingrunr21.vscode-ruby
wmaurer.change-case
xabikos.JavaScriptSnippets
Zignd.html-css-class-completion